# Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N в виде списка.
# Например:
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]

print('Введите число ')
n = int(input())
list = []

if n < 1:
    print('Введите число > 0 ')
else:
    n = range(1,n+1)
    i = 1
    result = 1
    for i in n:
        result *= i
        list.append(result)
print(list)

